# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024] 
  m: [0.50, 1.00, 512] 
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.50, 512] #

# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv_SFADC_Lite, [128, 3, 2]]       
  - [-1, 2, C3k2SFADC, [256, False, 0.25]] # 2-P2
  - [-1, 1, Conv_SFADC_Lite, [256, 3, 2]]      
  - [-1, 2, C3k2SFADC, [512, False, 0.25]] # 4-P3
  - [-1, 1, Conv_SFADC_Lite, [512, 3, 2]] # 5
  - [-1, 2, C3k2, [512, True]] # 6-P4
  - [-1, 1, Conv_SFADC_Lite, [1024, 3, 2]]      # 7🔸 
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF_SFADC, [1024, 5]]              # 9🔸 
  - [-1, 2, C2PSA, [1024]] # 10-P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "bilinear"]] # 10->11
  - [4, 1, Conv_SFADC_Lite, [256, 3, 2]] # 4->12
  - [[-1, 6, 11], 1, Concat, [1]] # cat backbone P4 
  - [-1, 2, C3k2, [512, False]] # 14
  - [-1, 1, nn.Upsample, [None, 2, "bilinear"]] # 15
  - [2, 1, Conv_SFADC_Lite, [128, 3, 2]] # 2->16
  - [[-1, 4, 15], 1, Concat, [1]] # cat backbone P3 17
  - [-1, 2, C3k2, [256, False]] # (P3/8-small) 18

  - [-1, 1, Conv_SFADC_Lite, [256, 3, 2]] # 18->19
  - [[-1, 14, 11], 1, Concat, [1]] # cat head P4 20
  - [-1, 2, C3k2, [512, False]] # (P4/16-medium) 21

  - [-1, 1, Conv_SFADC_Lite, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # (P5/32-large) 24

  - [[18, 21, 24], 1, Detect, [nc]]
